In [ ]:
## I am modifying this code

In [1]:
# Create a sample dataframe has missing values
import numpy as np
import pandas as pd

data={"Name":['Ram','Laxman',np.nan,'Sita'],"Ages":[np.nan,23,22,21],"City":['Hyd','Blr','Pune',np.nan]}
pd.DataFrame(data)

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [ ]:
# NAN : Not a number

In [3]:
df=pd.DataFrame(data)
df.shape

(4, 3)

In [4]:
df.isnull()

    Name   Ages   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [5]:
df.isnull().sum()

Name    1
Ages    1
City    1
dtype: int64

$Method - 1:$

**Fill with a random value**

In [8]:
df.fillna(40,inplace=True)

# inplace=True

In [9]:
df

     Name  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  Pune
3    Sita  21.0    40

$Method-2:$
    
**Select a particular column and fill with random number**

In [17]:
import numpy as np
import pandas as pd

data={"Name":['Ram','Laxman',np.nan,'Sita'],"Ages":[np.nan,23,22,21],"City":['Hyd','Blr','Pune',np.nan]}
df=pd.DataFrame(data)
df

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [18]:
df.dtypes

Name     object
Ages    float64
City     object
dtype: object

In [19]:
df['Ages'].fillna('20')

0      20
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: object

In [22]:
df

      Name  Ages     City
0      Ram   NaN      Hyd
1   Laxman  23.0      Blr
2  Krishna  22.0     Pune
3     Sita  21.0  Chennai

In [23]:
df['Ages'].fillna('20',inplace=True)

In [24]:
df

      Name  Ages     City
0      Ram    20      Hyd
1   Laxman  23.0      Blr
2  Krishna  22.0     Pune
3     Sita  21.0  Chennai

In [25]:
df['Name'].fillna('Krishna',inplace=True)
df['City'].fillna('Chennai',inplace=True)

In [26]:
df

      Name  Ages     City
0      Ram    20      Hyd
1   Laxman  23.0      Blr
2  Krishna  22.0     Pune
3     Sita  21.0  Chennai

$Method-3:$
    
**Pad**

In [27]:
import numpy as np
import pandas as pd

data={"Name":['Ram','Laxman',np.nan,'Sita'],"Ages":[np.nan,23,22,21],"City":['Hyd','Blr','Pune',np.nan]}
df=pd.DataFrame(data)
df

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [28]:
df.fillna(method='pad')

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [30]:
df.fillna(method='backfill')

     Name  Ages  City
0     Ram  23.0   Hyd
1  Laxman  23.0   Blr
2    Sita  22.0  Pune
3    Sita  21.0   NaN

In [31]:
df.fillna(method='ffill')

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [32]:
# Axis=0 : rows
# Axis=1 : columns

df.fillna(method='pad')

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [ ]:
$Method-4:$
    
**Fill the

In [33]:
df.fillna(method='pad',axis=0)

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [34]:
df.fillna(method='pad',axis=1)

     Name  Ages  City
0     Ram   Ram   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0  21.0

In [ ]:
age      income
30         50k
31         60k
35         1l
35         1l

mean    median    mode

$Method-5:$
    
- Random values
- pad
- bfill
- mean,median,mode

In [35]:
import numpy as np
import pandas as pd

data={"Name":['Ram','Laxman',np.nan,'Sita'],"Ages":[np.nan,23,22,21],"City":['Hyd','Blr','Pune',np.nan]}
df=pd.DataFrame(data)
df

     Name  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [37]:
mean_age=df['Ages'].mean()
mean_age

22.0

In [39]:
df['Ages'].fillna(mean_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [41]:
median_age=df['Ages'].median()
median_age

22.0

In [42]:
df['Ages'].fillna(median_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64